tympani/driver/app/views/sequences/_form.html.erb


<% @sequence.poofers.each do |poofer|%>
---
SELECT "poofers".* FROM "poofers" INNER JOIN "poofer_sequences" ON "poofers".id = "poofer_sequences".poofer_id WHERE (("poofer_sequences".sequence_id = 1))