tympani/driver/app/controllers/poofers_controller.rb

SELECT "poofers".* FROM "poofers"
---
  def index
    @poofers = Poofer.all

SELECT "poofers".* FROM "poofers" WHERE "poofers"."id" = 1 LIMIT 1
---
  def show
    @poofer = Poofer.find(params[:id])

INSERT INTO "poofers" ("updated_at", "relay", "created_at", "board") VALUES ('2011-08-09 00:10:43.118102', 2, '2011-08-09 00:10:43.118102', 1)
---
  def create
    @poofer = Poofer.new(params[:poofer])

    respond_to do |format|
      if @poofer.save