tympani/driver/app/controllers/poofer_sequences_controller.rb

SELECT "poofer_sequences".* FROM "poofer_sequences"
---
  def index
    @poofer_sequences = PooferSequence.all

SELECT "poofer_sequences".* FROM "poofer_sequences" WHERE "poofer_sequences"."id" = 1 LIMIT 1
---
  def show
    @poofer_sequence = PooferSequence.find(params[:id])

SELECT "poofer_sequences".* FROM "poofer_sequences" WHERE "poofer_sequences"."id" = 2 LIMIT 1
---
  def edit
    @poofer_sequence = PooferSequence.find(params[:id])

INSERT INTO "poofer_sequences" ("firing_time", "sequence_id", "created_at", "firing", "poofer_id", "updated_at") VALUES (NULL, 1, '2011-08-09 21:55:28.243249', NULL, 2, '2011-08-09 21:55:28.243249')
---
  def create
    @poofer_sequence = PooferSequence.new(params[:poofer_sequence])

    respond_to do |format|
      if @poofer_sequence.save

SELECT "poofer_sequences".* FROM "poofer_sequences" WHERE "poofer_sequences"."id" = 2 LIMIT 1
UPDATE "poofer_sequences" SET "firing_time" = 0, "updated_at" = '2011-08-09 22:48:21.198237' WHERE "poofer_sequences"."id" = 2
---
  def update
    @poofer_sequence = PooferSequence.find(params[:id])

    respond_to do |format|
      if @poofer_sequence.update_attributes(params[:poofer_sequence])