tympani/driver/app/controllers/sequences_controller.rb

SELECT "sequences".* FROM "sequences"
---
  def index
    @sequences = Sequence.all

SELECT "sequences".* FROM "sequences" WHERE "sequences"."id" = 1 LIMIT 1
---
  def show
    @sequence = Sequence.find(params[:id])

SELECT "sequences".* FROM "sequences" WHERE "sequences"."id" = 1 LIMIT 1
SELECT "poofers".* FROM "poofers"
---
  def edit
    @sequence = Sequence.find(params[:id])
    @poofers = Poofer.all

INSERT INTO "sequences" ("created_at", "updated_at", "name") VALUES ('2011-08-09 00:04:17.190024', '2011-08-09 00:04:17.190024', 'chase')
---
  def create
    @sequence = Sequence.new(params[:sequence])

    respond_to do |format|
      if @sequence.save

SELECT "sequences".* FROM "sequences" WHERE "sequences"."id" = 1 LIMIT 1
UPDATE "sequences" SET "step_delay" = 250, "updated_at" = '2011-08-09 00:42:33.699122' WHERE "sequences"."id" = 1
---
  def update
    @sequence = Sequence.find(params[:id])

    respond_to do |format|
      if @sequence.update_attributes(params[:sequence])